{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.1.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "521"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/StridedSlice/feature_patches/frame/zeros_like", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/mul/feature_patches/frame/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/concat/feature_patches/frame/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/StridedSlice/feature_patches/frame/ones_like", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/floordiv_3/feature_patches/frame/floordiv_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/concat_1/values_1/feature_patches/frame/concat_1/values_1/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/concat_1/feature_patches/frame/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/range_1/feature_patches/frame/range_1/start", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/range_1/feature_patches/frame/range_1/delta", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/Reshape_2/shape/feature_patches/frame/Reshape_2/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/add_1/feature_patches/frame/Reshape_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/GatherV2/feature_patches/frame/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/Maximum/feature_patches/frame/Maximum/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/add/feature_patches/frame/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/Reshape/feature_patches/frame/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/sub_2/feature_patches/frame/frame_length", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/floordiv/feature_patches/frame/frame_step", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/concat_2/values_1/feature_patches/frame/frame_length", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/split/feature_patches/frame/packed", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/split/feature_patches/frame/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/concat_2/feature_patches/frame/concat_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/reshape/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/reshape/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/reshape/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/reshape/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/reshape/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/reshape/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/global_average_pooling2d/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "521"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "521"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/StridedSlice/log_mel_features/stft/frame/zeros_like", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/mul/log_mel_features/stft/frame/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat/log_mel_features/stft/frame/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/StridedSlice/log_mel_features/stft/frame/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/floordiv_3/log_mel_features/stft/frame/floordiv_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_1/values_1/log_mel_features/stft/frame/concat_1/values_1/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_1/log_mel_features/stft/frame/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/range_1/log_mel_features/stft/frame/range_1/start", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/range_1/log_mel_features/stft/frame/range_1/delta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/mul_1/log_mel_features/stft/frame/floordiv_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape_2/shape/log_mel_features/stft/frame/Reshape_2/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/add_1/log_mel_features/stft/frame/Reshape_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/GatherV2/log_mel_features/stft/frame/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Maximum/log_mel_features/stft/frame/Maximum/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/add/log_mel_features/stft/frame/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape/log_mel_features/stft/frame/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/sub_2/log_mel_features/stft/frame_length", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/floordiv/log_mel_features/stft/frame_step", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_2/values_1/log_mel_features/stft/frame_length", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/packed", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_2/log_mel_features/stft/frame/concat_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/mul/log_mel_features/stft/hann_window/sub_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/rfft/Pad/log_mel_features/stft/rfft/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/rfft/log_mel_features/stft/rfft/fft_length", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/MatMul/log_mel_features/linear_to_mel_weight_matrix", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "257"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/add/log_mel_features/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer1/conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer1/conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer12/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer2/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer2/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer2/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer2/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer3/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer3/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer3/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer13/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer3/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer4/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer4/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer4/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer13/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer4/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer5/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer5/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer5/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer5/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer13/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer6/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer6/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer6/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer6/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer13/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer7/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer7/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer7/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer7/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer8/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer8/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer8/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer14/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer8/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer9/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer9/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer9/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer14/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer9/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer10/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer10/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer10/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer10/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer14/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer11/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer11/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer11/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer11/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer14/pointwise_conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer12/depthwise_conv/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer12/depthwise_conv/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/layer12/pointwise_conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_Squeeze/Squeeze", "op": "Squeeze", "input": ["input_1"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Shape/log_mel_features/stft/frame/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_Squeeze/Squeeze"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/split", "op": "SplitV", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Shape/log_mel_features/stft/frame/Shape", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/packed", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/split/split_dim"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}, "num_split": {"i": "3"}, "Tlen": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape/log_mel_features/stft/frame/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/split:1", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape/log_mel_features/stft/frame/Reshape/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/floordiv_3/log_mel_features/stft/frame/floordiv_3", "op": "FloorDiv", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape/log_mel_features/stft/frame/Reshape", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/floordiv_3/log_mel_features/stft/frame/floordiv_3/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/sub_2/log_mel_features/stft/frame/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape/log_mel_features/stft/frame/Reshape", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/sub_2/log_mel_features/stft/frame_length"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/mul/log_mel_features/stft/frame/mul", "op": "Mul", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/floordiv_3/log_mel_features/stft/frame/floordiv_3", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/mul/log_mel_features/stft/frame/mul/y"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_1/values_1/log_mel_features/stft/frame/concat_1/values_1", "op": "Pack", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/floordiv_3/log_mel_features/stft/frame/floordiv_3", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_1/values_1/log_mel_features/stft/frame/concat_1/values_1/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/floordiv/log_mel_features/stft/frame/floordiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/sub_2/log_mel_features/stft/frame/sub_2", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/floordiv/log_mel_features/stft/frame_step"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat/values_1/log_mel_features/stft/frame/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/mul/log_mel_features/stft/frame/mul"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_1/log_mel_features/stft/frame/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/split", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_1/values_1/log_mel_features/stft/frame/concat_1/values_1", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/split:2", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_1/log_mel_features/stft/frame/concat_1/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/add/log_mel_features/stft/frame/add", "op": "AddV2", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/add/log_mel_features/stft/frame/add/x", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/floordiv/log_mel_features/stft/frame/floordiv"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat/values_1/log_mel_features/stft/frame/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/mul/log_mel_features/stft/frame/mul", "ConstantFolding/StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat/values_1/log_mel_features/stft/frame/concat/values_1_const_axis"], "attr": {"_cloned": {"b": true}, "Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Maximum/log_mel_features/stft/frame/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Maximum/log_mel_features/stft/frame/Maximum/x", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/add/log_mel_features/stft/frame/add"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat/log_mel_features/stft/frame/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/split", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat/values_1/log_mel_features/stft/frame/concat/values_1", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/split:2", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat/log_mel_features/stft/frame/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/range_1/log_mel_features/stft/frame/range_1", "op": "Range", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/range_1/log_mel_features/stft/frame/range_1/start", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Maximum/log_mel_features/stft/frame/Maximum", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/range_1/log_mel_features/stft/frame/range_1/delta"], "attr": {"Tidx": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape_2/shape/log_mel_features/stft/frame/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Maximum/log_mel_features/stft/frame/Maximum", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape_2/shape/log_mel_features/stft/frame/Reshape_2/shape/1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_2/values_1/log_mel_features/stft/frame/concat_2/values_1", "op": "Pack", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Maximum/log_mel_features/stft/frame/Maximum", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_2/values_1/log_mel_features/stft/frame_length"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/StridedSlice/log_mel_features/stft/frame/StridedSlice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_Squeeze/Squeeze", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/StridedSlice/log_mel_features/stft/frame/zeros_like", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat/log_mel_features/stft/frame/concat", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/StridedSlice/log_mel_features/stft/frame/ones_like"], "attr": {"_cloned": {"b": true}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/mul_1/log_mel_features/stft/frame/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/range_1/log_mel_features/stft/frame/range_1", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/mul_1/log_mel_features/stft/frame/floordiv_2"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_2/log_mel_features/stft/frame/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/split", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_2/values_1/log_mel_features/stft/frame/concat_2/values_1", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/split/log_mel_features/stft/frame/split:2", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_2/log_mel_features/stft/frame/concat_2/axis"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape_1/log_mel_features/stft/frame/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/StridedSlice/log_mel_features/stft/frame/StridedSlice", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_1/log_mel_features/stft/frame/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape_2/log_mel_features/stft/frame/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/mul_1/log_mel_features/stft/frame/mul_1", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape_2/shape/log_mel_features/stft/frame/Reshape_2/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/add_1/log_mel_features/stft/frame/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape_2/log_mel_features/stft/frame/Reshape_2", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/add_1/log_mel_features/stft/frame/Reshape_3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/GatherV2/log_mel_features/stft/frame/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape_1/log_mel_features/stft/frame/Reshape_1", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/add_1/log_mel_features/stft/frame/add_1", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/GatherV2/log_mel_features/stft/frame/strided_slice"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape_4/log_mel_features/stft/frame/Reshape_4", "op": "Reshape", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/GatherV2/log_mel_features/stft/frame/GatherV2", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/concat_2/log_mel_features/stft/frame/concat_2"], "attr": {"Tshape": {"type": "DT_INT32"}, "_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/mul/log_mel_features/stft/mul", "op": "Mul", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/frame/Reshape_4/log_mel_features/stft/frame/Reshape_4", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/mul/log_mel_features/stft/hann_window/sub_2"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/rfft/Pad/log_mel_features/stft/rfft/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/mul/log_mel_features/stft/mul", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/rfft/Pad/log_mel_features/stft/rfft/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/rfft/log_mel_features/stft/rfft", "op": "RFFT", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/rfft/Pad/log_mel_features/stft/rfft/Pad", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/rfft/log_mel_features/stft/rfft/fft_length"], "attr": {"_cloned": {"b": true}, "Tcomplex": {"type": "DT_COMPLEX64"}, "Treal": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/Abs/log_mel_features/Abs", "op": "ComplexAbs", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/stft/rfft/log_mel_features/stft/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "_cloned": {"b": true}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/MatMul/log_mel_features/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/Abs/log_mel_features/Abs", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/MatMul/log_mel_features/linear_to_mel_weight_matrix"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/add/log_mel_features/add", "op": "AddV2", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/MatMul/log_mel_features/MatMul", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/add/log_mel_features/add/y"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/Log/log_mel_features/Log", "op": "Log", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/add/log_mel_features/add"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/Shape/feature_patches/frame/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/Log/log_mel_features/Log"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_log_mel_features/Log/log_mel_features/Log"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/split/feature_patches/frame/split", "op": "SplitV", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/Shape/feature_patches/frame/Shape", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/split/feature_patches/frame/packed", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/split/feature_patches/frame/split/split_dim"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Tlen": {"type": "DT_INT32"}, "num_split": {"i": "3"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/Reshape/feature_patches/frame/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/split/feature_patches/frame/split:1", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/Reshape/feature_patches/frame/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/floordiv_3/feature_patches/frame/floordiv_3", "op": "FloorDiv", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/Reshape/feature_patches/frame/Reshape", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/floordiv_3/feature_patches/frame/floordiv_3/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/sub_2/feature_patches/frame/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/Reshape/feature_patches/frame/Reshape", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/sub_2/feature_patches/frame/frame_length"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/mul/feature_patches/frame/mul", "op": "Mul", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/floordiv_3/feature_patches/frame/floordiv_3", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/mul/feature_patches/frame/mul/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/concat_1/values_1/feature_patches/frame/concat_1/values_1", "op": "Pack", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/floordiv_3/feature_patches/frame/floordiv_3", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/concat_1/values_1/feature_patches/frame/concat_1/values_1/1"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/floordiv/feature_patches/frame/floordiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/sub_2/feature_patches/frame/sub_2", "StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/floordiv/feature_patches/frame/frame_step"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "ConstantFolding/StatefulPartitionedCall/yamnet_frames/tf_op_layer_feature_patches/frame/concat/values_1/feature_patches/frame/concat/values_1_const_axis", "op": "Const", "input": 